app/controllers/questions_controller.rb

INSERT INTO "questions" ("text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["text", "ddd"], ["created_at", "2020-09-17 16:34:52.871208"], ["updated_at", "2020-09-17 16:34:52.871208"], ["user_id", 2]]
---
  def create
    @question = Question.new(question_params)

    @question.author = current_user

    if @question.save

UPDATE "questions" SET "user_id" = ?, "text" = ?, "answer" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["user_id", 1], ["text", "Переведи деньги!!!"], ["answer", "А то хуже будет\r\n \r\nНомер карты 34898345997834"], ["updated_at", "2020-09-18 13:57:35.895745"], ["id", 4]]
---
  def update
    if @question.update(question_params)

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    user = @question.user
    @question.destroy

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def load_question
      @question = Question.find(params[:id])