app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "agent555@mail.ru"], ["LIMIT", 1]]
---
  def create
    user = User.authenticate(params[:email], params[:password])

    if user.present?