app/controllers/users_controller.rb

  def create
    redirect_to root_url, alert: 'Вы уже залогинены' if current_user.present?

    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "username", "created_at", "updated_at", "email", "password_hash", "password_salt") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "avatar_url" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "agent007"], ["avatar_url", ""], ["updated_at", "2020-09-12 17:22:01.515808"], ["id", 1]]

  def show
    @questions = @user.questions.order(created_at: :desc)
    @new_question = @user.questions.build

    @number_questions = @user.questions.count
    @number_answer = @questions.where.not(answer: nil).count
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? ORDER BY "questions"."created_at" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ? AND "questions"."answer" IS NOT NULL  [["user_id", 2]]

  def load_user
    @user ||= User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]