app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "agent555@mail.ru"], ["LIMIT", 1]]
---
  def self.authenticate(email, password)
    # Сперва находим кандидата по email
    user = find_by(email: email&.downcase)

    # Если пользователь не найдет, возвращаем nil
    return nil unless user.present?